[
    {
        "src": "https://i.insider.com/5f4fa6f6e6ff30001d4e694b?width=1200&format=jpeg",
        "topic": "Social Media",
        "label": "A BATTLE YOU CAN NEVER WIN",
        "writter": "Yasin Billah",
        "content": "There are several trends happening in our world a genuinely terrifying vision of the not-too-distant future if we blend all together. It starts with Social media which is an inseparable part of our life right now. Now just think about this, every time you scroll through social media, what do you feel? Maybe you will or won’t agree with me, most of the time you feel not so good. Not because you just waste 20-30 minutes on it but mostly because what you have spent time looking at is how good other people are, how good other people look, how good their holidays are, how good their life with friends and family, how good they’re singing voice’s, their art, their talents. No one wants to share the things that they’re embarrassed about. Humans are actually wired to seek social validation and status. And so 99% of what you see on social media is just a highlight reel. You want to use it because social media gives you a very short-term high from being able to vicariously experience the best parts of other people’s lives. But the consequence of doing so is that when you then return to your own, you’re going to feel like something’s missing. And then there’s the other side to it social media gives us the ability to effectively rewrite our lives. Say if you’re proud of your career you’ll post about your job promotion. If you want to seem like an avid traveler you will post that photo of you lounging on a beach under the guise that this is just a normal day in your life. And show how adventurous you are you will post that crazy beautiful sunset that you saw by hiking to the top of a mountain. Maybe even editing it along the way to make it seem more vibrant than it was. At Joe Rogan podcast #1169, Elon musk pointed out to Instagram when he was asked about social media’s negative effects on us. You can find this clip of the podcast from the link below. Elon musk describes how people on Instagram look like they have a much better life than they really do. People have the option to re-design, so people are posting pictures of when they’re really happy, they modify those pictures to be better. Even if they’re not modifying the pictures, they are at least selecting the pictures for the best possible form. People are way better looking and happier seeming than they really are. so if you look at everyone on Instagram you might think “man! they're all these happy beautiful people and I'm not that good-looking and I am not happy” and that's gonna make you feel sad so when in fact those people you think are super happy actually not that happy some of them actually depressed like normal. Just look at TikTok filters, the reason this app is so successful is that it basically gives users a limitless toolkit to make them the funniest and hottest versions of themselves for everyone else. It let them tell the story they want to tell. And so when you combine this idea that you can literally remake yourself online with the feeling that you kind of have to keep up with how great everyone else’s lives are, apparently you can see how it makes us so unbelievably insecure about our real lives, jealous and just not as happy as we could be. We’ve gone from comparing our imperfect lives to the imperfect lives of the five-six neighbors around us to now comparing our imperfect lives to a curated compilation of the most moments from a much wider pool of people, AND THAT’S A BATTLE YOU CAN NEVER WIN",
        "date": "11/11/2021",
        "id": 1
    },
    {
        "src": "https://res.cloudinary.com/kentcdodds-com/image/upload/w_1100,q_auto,f_auto,b_rgb:e6e9ee/unsplash/photo-1534870439272-475575042b61",
        "topic": "React JS",
        "label": "How to use React Context effectively",
        "writter": "Kent C Dodds",
        "content": "In Application State Management with React, I talk about how using a mix of local state and React Context can help you manage state well in any React application. I showed some examples and I want to call out a few things about those examples and how you can create React context consumers effectively so you avoid some problems and improve the developer experience and maintainability of the context objects you create for your application and/or libraries. First off, I don't have an initial value for the CountContext. If I wanted an initial value, I would call React.createContext({count: 0}). But I don't include a default value and that's intentional. Because we don't have a default value for our CountContext, we'll get an error on the highlighted line where we're destructuring the return value of useContext. This is because our default value is undefined and you cannot destructure undefined. None of us likes runtime errors, so your knee-jerk reaction may be to add a default value to avoid the runtime error. However, what use would the context be if it didn't have an actual value? If it's just using the default value that's been provided, then it can't really do much good. 99% of the time that you're going to be creating and using context in your application, you want your context consumers (those using useContext) to be rendered within a provider which can provide a useful value. The React docs suggest that providing a default value can be helpful in testing components in isolation without wrapping them. While it's true that it allows you to do this, I disagree that it's better than wrapping your components with the necessary context. Remember that every time you do something in your test that you don't do in your application, you reduce the amount of confidence that test can give you. There are reasons to do this, but that's not one of them. First, the useCount custom hook uses React.useContext to get the provided context value from the nearest CountProvider. However, if there is no value, then we throw a helpful error message indicating that the hook is not being called within a function component that is rendered within a CountProvider. This is most certainly a mistake, so providing the error message is valuable. #FailFast This is a great question. What happens if you have a situation where you need to make some asynchronous request and you need to dispatch multiple things over the course of that request? Sure you could do it at the calling component, but manually wiring all of that together for every component that needs to do something like that would be pretty annoying. What I suggest is you make a helper function within your context module which accepts dispatch along with any other data you need, and make that helper be responsible for dealing with all of that. Note that I'm NOT exporting CountContext. This is intentional. I expose only one way to provide the context value and only one way to consume it. This allows me to ensure that people are using the context value the way it should be and it allows me to provide useful utilities for my consumers. I hope this is useful to you! Remember: You shouldn't be reaching for context to solve every state sharing problem that crosses your desk. Context does NOT have to be global to the whole app, but can be applied to one part of your tree You can (and probably should) have multiple logically separated contexts in your app. Good luck!",
        "date": "5/6/2021",
        "id": 2
    },
    {
        "src": "https://53.fs1.hubspotusercontent-na1.net/hub/53/hubfs/sentiment-analysis-tools-1.jpg?width=893&height=600&name=sentiment-analysis-tools-1.jpg",
        "topic": "Machine Learning",
        "label": "The Best 12 Sentiment Analysis Tools in 2021",
        "writter": "CLint Fontanella",
        "content": "Have you ever received a text from a family member and couldn't tell if they were joking or not? Unless we directly tell the person how we feel, emotions and tone don't carry well over text, which often makes it difficult to determine the intent of a message. We can use punctuation to help, but there's no universal way to communicate things like sarcasm or irony through text. Spoiler alert, it never quite caught on and when technology like text messages, live chat, and social media came me about, people still had no definitive way of identifying the sentiment behind a text message. This became a real problem for businesses as they realized how difficult it was to determine if customer feedback was positive or negative. It's hard for a customer to describe a problem when they only can use 280 characters, and without proper context, customer service teams don't have the information they need to appropriately respond to the issue.  As text-based communication like social media and live chat become more popular in customer service, businesses need a way to accurately and efficiently filter their customers' feedback. This is where a sentiment analysis tool comes in handy to interpret a text and explain the intent or tone of a customer's message. In this post, we'll explain what a sentiment analysis tool is and provide a list of the best options available for your team this year. What Is a Sentiment Analysis Tool? A sentiment analysis tool is software that analyzes text conversations and evaluates the tone, intent, and emotion behind each message. By digging deeper into these elements, the tool uncovers more context from your conversations and helps your customer service team accurately analyze feedback. This is particularly useful for brands that actively engage with their customers on social media, live chat, and email where it can be difficult to determine the sentiment behind a message. Brand Sentiment Analysis. Sentiment analysis helps brands learn more about customer perception using qualitative feedback. By leveraging an automated system to analyze text-based conversations, businesses can discover how customers genuinely feel about their products, services, marketing campaigns, and more.Benefits of Adopting a Sentiment Analysis Tool. If your company provides an omni-channel experience, a sentiment analysis tool can save your team valuable time organizing and reporting customer feedback. Rather than going through each tweet and comment one-by-one, a sentiment analysis tool processes your feedback and automatically interprets whether it's positive, negative, or neutral. Then, it compounds your data and displays it in charts or graphs that clearly outline trends in your customer feedback. This not only gives your team accurate information to work with, but frees up time for your employees to work on other tasks in their day-to-day workflow.Now that you know what a sentiment analysis tool is and how it can benefit your business, let's take a look at some of the best tools available for 2021. Quick Search Repustate Lexalytics Critical Mention Brandwatch Social Mention Analyzer MAXG Social Searcher Rosette",
        "date": "02/12/2021",
        "id": 3
    }
]